#через вайл не смог сделать, так что вот код через фор:

# Дано натуральное число. Напишите программу, которая вычисляет:
# количество цифр 3 в нём;
# сколько раз в нём встречается последняя цифра;
# количество чётных цифр;
# сумму его цифр, больших пяти;
# произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести её);
# сколько раз в нём встречаются цифры 0 и 5 (всего суммарно).


#ввод числа
number = input("Введите натуральное число: ")


count_3 = 0 #для количества цифр 3
last_num = number[-1] #последняя цифра
last_num_sum = 0 #для подсчёта вхождений последней цифры
even_count = 0 #для подсчёта чётных цифр
sum_over_5 = 0 #для суммы цифр > 5
mult_over_7 = 1 #для произведенияд цифр > 7
zero_five_summ = 0 #для подсчёта 0 и 5
found_over_7 = 0 #наличие цифр > 7 ноль или один


for digit in number:
    digit = int(digit)

    if digit == 3:
        count_3 += 1

    if str(digit) == last_num:
        last_num_sum += 1

    if digit % 2 == 0:
        even_count += 1

    if digit > 5:
        sum_over_5 += digit

    if digit > 7:
        mult_over_7 *= digit
        found_over_7 = True

    if digit == 0 or digit == 5:
        zero_five_summ += 1

# "если не было цифр >7"
if not found_over_7:
    mult_over_7 = 1

print(f"Количество цифр 3: {count_3}")
print(f"Встречается последняя цифра: {last_num_sum} раз")
print(f"Количество чётных цифр: {even_count}")
print(f"Сумма цифр > 5: {sum_over_5}")
print(f"Произведение цифр > 7: {mult_over_7}")
print(f"Количество 0 и 5: {zero_five_summ}")